---
kind: type
id: T:Autodesk.Revit.DB.ExtrusionRoof
source: html/c724b0cd-6135-e50c-0a14-932e7e55b860.htm
---
# Autodesk.Revit.DB.ExtrusionRoof

Represents some kinds of Extrusion Roofs.

## Syntax (C#)
```csharp
public class ExtrusionRoof : RoofBase
```

## Remarks
The ExtrusionRoof object represents some kinds of extruded roofs in Revit.